# Assessment Python Review

<img src="images/UnivariateAnalysis.jpg"/>

### Python Libraries

In [1]:
import numpy as np
import pandas as pd

**Write a function that inputs an integers and returns the negative.**

In [2]:
def inv_x(x):
    out = -x
    return out

Test your function with input x, x=4.

In [3]:
inv_x(4)

-4

**Write a function that inputs a list of integers and returns the minimum value.**

In [4]:
def get_min(lista):
    current_min = lista[0]
    for i in lista[1:]:
        if i < current_min:
            current_min = i
    return current_min

Test your function with input lst = [-3, 0, 2, 100, -1, 2].

In [5]:
lst = [-3, 0, 2, 100, -1, 2]

get_min(lst)

-3

#### Challenge problem:  
Write a function that take in four arguments: lst1, lst2, str1, str2, and returns a pandas DataFrame that has the first column labeled str1 and the second column labaled str2, that have values lst1 and lst2 scaled to be between 0 and 1.

For example
```
lst1 = [1, 2, 3]
lst2 = [2, 4, 5]
str1 = 'one'
str2 = 'two'

my_function(lst1, lst2, str1, str2)
``` 
should return a DataFrame that looks like:



|  <i></i> | one | two |
| --- | --- | --- |
| 0 | 0 | 0 |
| 1 | .5 | .666 |
| 2 | 1 | 1 |

In [6]:
lst1 = [1, 2, 3]
lst2 = [2, 4, 5]
str1 = 'one'
str2 = 'two'

def my_function(lst1, lst2, str1, str2):
    df = pd.DataFrame({str1:lst1, str2:lst2})
    return df

my_function(lst1, lst2, str1, str2)

   one  two
0    1    2
1    2    4
2    3    5

#### Test your challenge problem function

    lst1 = np.random.randint(-234, 938, 100)
    lst2 = np.random.randint(-522, 123, 100)
    str1 = 'one'
    str2 = 'alpha'

In [7]:
lst1 = np.random.randint(-234, 938, 100)
lst2 = np.random.randint(-522, 123, 100)
str1 = 'one'
str2 = 'alpha'

my_function(lst1, lst2, str1, str2)

    one  alpha
0   738   -498
1    64     87
2   489     68
3   214   -298
4   313   -166
..  ...    ...
95  721   -330
96  769      0
97   -4      3
98  515     92
99  430   -345

[100 rows x 2 columns]

**Rename the columns as 'apples'and 'oranges'**

In [8]:
df = my_function(lst1, lst2, str1, str2)

df.rename({'one': 'apples', 'alpha':'oranges'}, axis=1, inplace=True)

df.head()

   apples  oranges
0     738     -498
1      64       87
2     489       68
3     214     -298
4     313     -166

**Create a new column 'banatas' that the elements are the sum of the elements of the other two columns.**

In [9]:
df['bananas'] = df['apples'] + df['oranges']

df.head()

   apples  oranges  bananas
0     738     -498      240
1      64       87      151
2     489       68      557
3     214     -298      -84
4     313     -166      147

In [10]:
# Another method for change all column names:

df.columns = ['col1','col2','col3']

df.head()

   col1  col2  col3
0   738  -498   240
1    64    87   151
2   489    68   557
3   214  -298   -84
4   313  -166   147